region_to_capital = {
    'Курганская обл': 'Кургана',
    'Ульяновская обл': 'Ульяновск',
    'Москва г': 'Москва',
    'Нижегородская обл': 'Нижнего',
    'Вологодская обл': 'Вологды',
    'Санкт-Петербург г': 'Санкт-Петербург',
    'Бурятия Респ': 'Улан-Удэ',
    'Ленинградская обл': 'Санкт-Петербурга',
    'Башкортостан Респ': 'Уфа',
    'Челябинская обл': 'Челябинск',
    'Рязанская обл': 'Рязани',
    'Иркутская обл': 'Иркутска',
    'Новосибирская обл': 'Новосибирск',
    'Красноярский край': 'Красноярска',
    'Владимирская обл': 'Владимира',
    'Карелия Респ': 'Петрозаводская',
    'Белгородская обл': 'Белгорода',
    'Архангельская обл': 'Архангельск',
    'Ростовская обл': 'Ростова-на-Дону',
    'Коми Респ': 'Сыктывкара',
    'Брянская обл': 'Брянск',
    'Мурманская обл': 'Мурманска',
    'Пермский край': 'Пермь',
    'Костромская обл': 'Костромы',
    'Тульская обл': 'Тулы',
    'Кировская обл': 'Кирова',
    'Липецкая обл': 'Липецка',
    'Калужская обл': 'Калуги',
    'Ярославская обл': 'Ярославль',
    'Смоленская обл': 'Смоленска',
    'Марий Эл Респ': 'Йошкар-Олы',
    'Дагестан Респ': 'Махачкалы',
    'Курская обл': 'Курска',
    'Свердловская обл': 'Свердловская',
    'Орловская обл': 'Орла',
    'Кабардино-Балкарская Респ': 'Нальчик',
    'Мордовия Респ': 'Саранск',
    'Тверская обл': 'Твери',
    'Татарстан Респ': 'Казани',
    'Хабаровский край': 'Хабаровска',
    'Пензенская обл': 'Пензы',
    'Омская обл': 'Омск',
    'Самарская обл': 'Самары',
    'Ханты-Мансийский автономный окр': 'Сургута',
    'Воронежская обл': 'Воронежа',
    'Ненецкий автономный окр': 'Нарьян-Мар',
    'Краснодарский край': 'Краснодара',
    'Саратовская обл': 'Саратова',
    'Удмуртская Респ': 'Ижевск',
    'Кемеровская обл': 'Кемерово',
    'Амурская обл': 'Благовещенска',
    'Томская обл': 'Томск',
    'Тамбовская обл': 'Тамбова',
    'Ивановская обл': 'Иванова',
    'Сахалинская обл': 'Южно-Сахалинска',
    'Тыва Респ': 'Кызыла',
    'Оренбургская обл': 'Оренбурга',
    'Северная Осетия Респ': 'Владикавказа',
    'Калмыкия Респ': 'Элисты',
    'Ставропольский край': 'Ставрополя',
    'Псковская обл': 'Пскова',
    'Крым Респ': 'Симферополя',
    'Чувашская Респ': 'Чебоксары-столицы',
    'Якутия Респ': 'Якутск',
    'Приморский край': 'Владивостока',
    'Калининградская обл': 'Калининграда',
    'Астраханская обл': 'Астрахани',
    'Волгоградская обл': 'Волгоград',
    'Чеченская Респ': 'Грозного',
    'Алтайский край': 'Барнаула',
    'Алтай Респ': 'Горно-Алтайска',
    'Забайкальский край': 'Читы',
    'Еврейская автономная обл': 'Биробиджан',
    'Тюменская обл': 'Тюмени',
    'Ингушетия Респ': 'Назрань',
    'Новгородская обл': 'Боровичи',
    'Карачаево-Черкесская Респ': 'Черкесска',
    'Хакасия Респ': 'Абакана',
    'Адыгея Респ': 'Майкоп',
    'Камчатский край': 'Магадана',
    'Магаданская обл': 'Магадана',
    'Севастополь г': 'Севастополя',
    'Чукотский автономный окр': 'Анадырь',
    'Донецкая Народная Респ': 'Донецка',
    'Луганская Народная Респ': 'Луганска',
    'Московская обл': 'Долгопрудный',
}

fixed_city_names = {
    'Кургана': 'Курган',
    'Нижнего': 'Нижний Новгород',
    'Вологды': 'Вологда',
    'Санкт-Петербурга': 'Санкт-Петербург',
    'Рязани': 'Рязань',
    'Иркутска': 'Иркутск',
    'Красноярска': 'Красноярск',
    'Владимира': 'Владимир',
    'Петрозаводская': 'Петрозаводск',
    'Белгорода': 'Белгород',
    'Ростова-на-Дону': 'Ростов-на-Дону',
    'Сыктывкара': 'Сыктывкар',
    'Мурманска': 'Мурманск',
    'Костромы': 'Кострома',
    'Тулы': 'Тула',
    'Кирова': 'Киров',
    'Липецка': 'Липецк',
    'Калуги': 'Калуга',
    'Ярославль': 'Ярославль',
    'Смоленска': 'Смоленск',
    'Йошкар-Олы': 'Йошкар-Ола',
    'Махачкалы': 'Махачкала',
    'Курска': 'Курск',
    'Свердловская': 'Екатеринбург',
    'Орла': 'Орел',
    'Казани': 'Казань',
    'Хабаровска': 'Хабаровск',
    'Пензы': 'Пенза',
    'Самары': 'Самара',
    'Сургута': 'Сургут',
    'Воронежа': 'Воронеж',
    'Краснодара': 'Краснодар',
    'Саратова': 'Саратов',
    'Ижевск': 'Ижевск',
    'Благовещенска': 'Благовещенск',
    'Тамбова': 'Тамбов',
    'Иванова': 'Иваново',
    'Южно-Сахалинска': 'Южно-Сахалинск',
    'Кызыла': 'Кызыл',
    'Оренбурга': 'Оренбург',
    'Владикавказа': 'Владикавказ',
    'Элисты': 'Элиста',
    'Ставрополя': 'Ставрополь',
    'Пскова': 'Псков',
    'Симферополя': 'Симферополь',
    'Чебоксары-столицы': 'Чебоксары',
    'Владивостока': 'Владивосток',
    'Калининграда': 'Калининград',
    'Астрахани': 'Астрахань',
    'Грозного': 'Грозный',
    'Барнаула': 'Барнаул',
    'Горно-Алтайска': 'Горно-Алтайск',
    'Читы': 'Чита',
    'Тюмени': 'Тюмень',
    'Назрань': 'Назрань',
    'Боровичи': 'Великий Новгород',
    'Магадана': 'Магадан',
    'Севастополя': 'Севастополь',
    'Донецка': 'Донецк',
    'Луганска': 'Луганск',
    'Шадринска': 'Шадринск'
}

schools_without_number = {
    "Лицей 'Вторая школа'",
    "Университетская гимназия (школа-интернат) МГУ",
    "Гимназия Раменское",
    "Новинская школа Орехово-Зуевский район",
    "Куровская гимназия",
    "Толбинская школа",
    "Гимназия Дмитров",
    "Физико-математический лицей Дубна",
    "Академический лицей Магнитогорск",
    "Предуниверситарий МГЛУ",
    "Вторая Санкт-Петербургская гимназия",
    "Курчатовская школа Москва",
    "Петергофская гимназия императора Александра II",
    "Катуаровская школа",
    "Школа имени Артема Боровика",
    "Школа Покровский квартал Москва",
    "Ликино-Дулёвский лицей",
    "Лицей Орехово-Зуево",
    "Православная гимназия Электросталь",
    "Дрезненская гимназия",
    "Частная гимназия «Альма Матер» Санкт-Петербург",
    "Школа 'Тутти' Санкт-Петербург",
    "Бухоловская школа",
    "Шаховская гимназия",
    "Видновская гимназия",
    "Лицей им. Стрельцова Воскресенск",
    "Школа 'Гармония' Маришкино",
    "Евсеевская школа г/о Павловский Посад",
    "Образовательный центр 'Протон' Москва",
    "Земская гимназия Балашиха",
    "Школа 'Созвездие Вента' Можайск",
    "Школа п.Восход Истринский район",
    "Гимназия Реутов",
    "Рощинская школа Сосновский район",
    "Школа 'Содружество' Москва",
    "Лицей Фрязино",
    "Лицей Дедовск",
    "Школа им. Комарова Звёздный городок",
    "Алабинская школа",
    "Школа Марьина Роща",
    "Школа Экотех+ Севастополь",
    "Введенская школа",
    "Гимназия им.Пушкина Бронницы",
    "Савостинская школа",
    "Микулинская гимназия",
    "Рогачевская школа Дмитровский район",
    "Радужненская школа г/о Коломенский",
    "Давыдовская гимназия",
    "Школа-интернат 'Олимпийский резерв' Сестрорецк",
    "Запрудненская гимназия",
    "Школа в Некрасовке",
    "Кадетская школа Павловск",
    "Ульяновская школа Путилково",
    "АНО ОШ ЦПМ",
    "ГБОУ Школа 'Покровский квартал'",
    "ОАНО Школа 'ЛЕТОВО'",
    "ГБОУ 'Школа на Юго-Востоке имени Маршала В.И. Чуйкова'",
    "Курчатовская школа",
    "Физтех-лицей имени П.Л. Капицы",
    "Структурное подразделение Новосибирского государственного университета - Специализированный учебно-научный центр Университета г. Новосибирск",
    "CУНЦ НГУ",
    "CУНЦ МГУ",
    "CУНЦ УРФУ",
}

type_inst = {
    'лице': 'лицей',
    'мбоу': 'школа',
    'моу': 'школа',
    'маоу': 'школа',
    'интернат': 'интернат',
    'колледж': 'колледж',
    'универ': 'университет',
    'гимназ': 'гимназия',
    'школ': 'школа',

}

# АУ – автономное учреждение
# АУК – автономное учреждение культуры
# БУ – бюджетное учреждение
# БУК – бюджетное учреждение культуры
# ГАОУ ВО – государственное автономное образовательное учреждение высшего образования
# ГАОУ ДПО – государственное автономное образовательное учреждение дополнительного профессионального образования
# ГАПОУ – государственное автономное профессиональное образовательное учреждение
# ГАУК – государственное автономное учреждение культуры
# ГБОУ – государственное бюджетное образовательное учреждение
# ГБПОУ – государственное бюджетное профессиональное образовательное учреждение
# ГБУ – государственное бюджетное учреждение
# ГБУК – государственное бюджетное учреждение культуры
# ГКБУ – государственное краевое бюджетное учреждение
# ГКБУК – государственное краевое бюджетное учреждение культуры
# ГКУ – государственное казённое учреждение
# ГКУК – государственное казённое учреждение культуры
# ГОБУК – государственное образовательное бюджетное учреждение культуры
# ГОУ ВО – государственное образовательное учреждение высшего образования
# ГОУ ВПО – государственное образовательное учреждение высшего профессионального образования
# ГПОУ – государственное профессиональное образовательное учреждение
# ГУ – государственное учреждение
# ГУК – государственное учреждение культуры
# КГАУК – краевое государственное автономное учреждение культуры
# КГБНУК – краевое государственное бюджетное научное учреждение культуры
# КГБУ – краевое государственное бюджетное учреждение
# КГКУ – краевое государственное казённое учреждение
# КГУ – краевое государственное учреждение
# МАОУ – муниципальное автономное общеобразовательное учреждение
# МАУ – муниципальное автономное учреждение
# МАУК – муниципальное автономное учреждение культуры
# МБОУ – муниципальное бюджетное общеобразовательное учреждение
# МБУ – муниципальное бюджетное учреждение
# МБУДО – муниципальное бюджетное учреждение дополнительного образования
# МБУК – муниципальное бюджетное учреждение культуры
# МБУКДО – муниципальное бюджетное учреждение культуры дополнительного образования
# МКУ – муниципальное казённое учреждение
# МКУК – муниципальное казённое учреждение культуры
# МУ – муниципальное учреждение
# МУК – муниципальное учреждение культуры
# НОУ ВПО – негосударственное образовательное учреждение высшего профессионального образования
# ОАНО – общеобразовательная автономная некоммерческая организация
# ОБУК – областное бюджетное учреждение культуры
# ОГАУК – областное государственное автономное учреждение культуры
# ОГБУК – областное государственное бюджетное учреждение культуры
# ОГКУК – областное государственное казённое учреждение культуры
# ФГАОУ ВО – федеральное государственное автономное образовательное учреждение высшего образования
# ФГАОУ ВПО – федеральное государственное автономное образовательное учреждение высшего профессионального образования
# ФГБВОУ ВО – федеральное государственное бюджетное военное образовательное учреждение высшего образования
# ФГБНИУ – федеральное государственное бюджетное научно-исследовательское учреждение
# ФГБНУ – федеральное государственное бюджетное научное учреждение
# ФГБОУ – федеральное государственное бюджетное образовательное учреждение
# ФГБУ – федеральное государственное бюджетное учреждение
# ФГБУК – федеральное государственное бюджетное учреждение культуры
# ФГБУН – федеральное государственное бюджетное учреждение науки
# ФГКВОУ – федеральное государственное казённое военное образовательное учреждение
# ФГКОУ – федеральное государственное казённое образовательное учреждение
# ФГОУ – федеральное государственное образовательное учреждение
# ФГУ – федеральное государственное учреждение
# ФГУП – федеральное государственное унитарное предприятие
# ФКУ – федеральное казённое учреждение
# ФКУК – федеральное казённое учреждение культуры
# ЧПОУ – частное профессиональное образовательное учреждение
# АБИС - автоматизированная библиотечно-информационная система
# АИС - автоматизированная информационная система
# АНО - автономная некоммерческая организация
# АО - акционерное общество
# АРБИКОН - Ассоциированные региональные библиотечные консорциумы
# БОУНБ - Биробиджанская областная универсальная научнаябиблиотека
# ВООПИиК - Всероссийское общество охраны памятников истории и культуры
# ГАИ - Гражданская автомобильная инспекция
# ГАХК - Государственный архив Хабаровского края
# ГДР - Германская Демократическая Республика
# ГПНТБ СО РАН - Государственная публичная научно-техническая библиотека Сибирского отделения Российской академии наук
# ДальНИИЛХ - Дальневосточный научно-исследовательский институт лесного хозяйства
# ДВГНБ - Дальневосточная государственная научная библиотека
# ДВГУПС - Дальневосточный государственный университет путей сообщения
# ДК - Дом культуры
# ДМШ - детская музыкальная школа
# ДФО - Дальневосточный федеральный округ
# ЕАО - Еврейская автономная область
# ЗАО - закрытое акционерное общество
# ИВЦ - Информационно-вычислительный центр (ДВГНБ)
# ИВЭП - Институт водных и экологических проблем (ДВО РАН)
# КНДР - Корейская Народно-Демократическая Республика
# КНОТОК - Краевое научно-образовательное творческое объединение культуры
# КНР - Китайская Народная Республика
# МАУ ДО - муниципальное автономное учреждение дополнительного образования
# МБУ - муниципальное бюджетное учреждение
# МБУК - муниципальное бюджетное учреждение культуры
# МКУК - муниципальное казённое учреждение культуры
# МПБ - межпоселенческая библиотека
# МУ - муниципальное учреждение
# НКО - некоммерческая организация
# НЭБ - Национальная электронная библиотека
# ООиФ - отдел обслуживания и фондов (ДВГНБ)
# ООО - общество с ограниченной ответственностью
# пгт - посёлок городского типа
# ПИ ТОГУ - Педагогический институт Тихоокеанского государственного университета
# ПК - персональный компьютер
# РАО - Российская академия образования
# РГПУ - Российский государственный педагогический университет
# СОШ - средняя общеобразовательная школа
# УМВД - управление министерства внутренних дел
# ФГБУ - федеральное государственное бюджетное учреждение
# МГУ - московский государственный университет
# ЦО - центр образования